# Ex3 - Getting and Knowing your Data

This time we are going to pull data directly from the internet.
Special thanks to: https://github.com/justmarkham for sharing the dataset and materials.

### Step 1. Import the necessary libraries

In [2]:
# Paso 1: saber qué datos tenemos que usar, qué hay que hacer, qué nos pide nuestro cliente
# Paso 2: aplicar la disciplina: ¿cómo cargar un archivo/URL tipo CSV, Excel, JSON, SQL...? --> buscar en Google, usar 
#         keywords, buscar en Stackoverflow, buscar la función, etc
# Como esta relación de ejercicios es para aprender a usar la librería de Pandas, obviamente hay que importar Pandas.
# PANDAS: Viene de PANel DAta. Python Data Analysis Library

import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

### Step 3. Assign it to a variable called users and use the 'user_id' as index

In [3]:
# Al ser un URL, solo copiamos el link. Antes de nombrar la variable, comprobar que la función funciona.

df = pd.read_csv(filepath_or_buffer="https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user",
            sep="|")

In [ ]:
d

In [5]:
df.index

RangeIndex(start=0, stop=943, step=1)

In [7]:
df.columns

Index(['user_id', 'age', 'gender', 'occupation', 'zip_code'], dtype='object')

In [8]:
df.shape

(943, 5)

In [10]:
df.keys()

Index(['user_id', 'age', 'gender', 'occupation', 'zip_code'], dtype='object')

In [13]:
df.index

RangeIndex(start=0, stop=943, step=1)

In [15]:
df.index = 'hola'

TypeError: Index(...) must be called with a collection of some kind, 'hola' was passed

In [20]:
df.index = [i**2 for i in range(943)]

In [17]:
df

        user_id  age gender     occupation zip_code
0             1   24      M     technician    85711
1             2   53      F          other    94043
4             3   23      M         writer    32067
9             4   24      M     technician    43537
16            5   33      F          other    15213
...         ...  ...    ...            ...      ...
879844      939   26      F        student    33319
881721      940   32      M  administrator    02215
883600      941   20      M        student    97229
885481      942   48      F      librarian    78209
887364      943   22      M        student    77841

[943 rows x 5 columns]

In [12]:
df.set_index(keys='user_id')

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
...      ...    ...            ...      ...
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[943 rows x 4 columns]

In [11]:
df

# Ahora tenemos que colocar el user_id como índice

     user_id  age gender     occupation zip_code
0          1   24      M     technician    85711
1          2   53      F          other    94043
2          3   23      M         writer    32067
3          4   24      M     technician    43537
4          5   33      F          other    15213
..       ...  ...    ...            ...      ...
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

[943 rows x 5 columns]

In [12]:
df.index

RangeIndex(start=0, stop=943, step=1)

In [23]:
df = pd.read_csv(filepath_or_buffer="https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user",
            sep="|", index_col=0)
df

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
...      ...    ...            ...      ...
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[943 rows x 4 columns]

In [24]:
df.index

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name='user_id', length=943)

### Step 4. See the first 25 entries

In [25]:
df.head(25)

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
11        39      F          other    30329
12        28      F          other    06405
13        47      M       educator    29206
14        45      M      scientist    55106
15        49      F       educator    97301
16        21      M  entertainment    10309
17        30      M     programmer    06355
18        35      F          other    37212
19        40      M      librarian    02138
20        42      F      homemaker    95660
21        26      M         writer    30068
22        25      M         writer    40206
23        30      F         artist    48197
24        21      F         artist    94533
25        39      M       engineer    55107

### Step 5. See the last 10 entries

In [26]:
df.tail(10)

         age gender     occupation zip_code
user_id
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

### Step 6. What is the number of observations in the dataset?

In [28]:
# se quiere saber el número de observaciones (filas) del conjunto de datos. Se puede ver incluso poniendo solo el 
# nombre de la variable 
# user_id
# user_id.count()
# user_id.index
# len(user_id)
# user_id.info()
df.shape[0]

943

In [29]:
df.count()

age           943
gender        943
occupation    943
zip_code      943
dtype: int64

In [30]:
len(df)

943

In [31]:
df.to_html('hola.html')

### Step 7. What is the number of columns in the dataset?

In [32]:
# También hay muchas maneras:
# user_id.columns --> te dice los nombres de las columnas, contearlo con len().
# len(user_id.columns)
# user_id.shape[1]
# len(list(user_id))
user_id.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 943 entries, 1 to 943
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   age         943 non-null    int64
 1   gender      943 non-null    object
 2   occupation  943 non-null    object
 3   zip_code    943 non-null    object
dtypes: int64(1), object(3)
memory usage: 36.8+ KB

In [33]:
df.shape[1]

4

### Step 8. Print the name of all the columns.

In [36]:
print(df.columns)

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

In [38]:
df.columns

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

In [39]:
for i in 'hola':
    print(i)

h
o
l
a

In [40]:
for i in 'hola':
    i

### Step 9. How is the dataset indexed?

In [43]:
# Simplemente es usar la función .index
# Index is like an address, that’s how any data point across the dataframe or series can be accessed. 
# Rows and columns both have indexes, rows indices are called as index and for columns its general column names.

df.index

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name='user_id', length=943)

### Step 10. What is the data type of each column?

In [44]:
# Cuando printeamos las columnas del df, aparecía que era de clase object. Hay más maneras de saberlo
# user_id.info()
df.dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

### Step 11. Print only the occupation column

In [45]:
df['occupation']
# user_id.occupation

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

In [48]:
df.shape

(943, 4)

In [52]:
a = {'nombres': ['pepe', 'maria'], 'peso': [435,46]}

In [53]:
a['altura']

KeyError: 'altura'

In [54]:
a.keys()

dict_keys(['nombres', 'peso'])

In [55]:
a['altura'] = 8

In [56]:
a

{'nombres': ['pepe', 'maria'], 'peso': [435, 46], 'altura': 8}

In [58]:
a

{'nombres': ['pepe', 'maria'], 'peso': [435, 46], 'altura': 8}

In [59]:
pd.DataFrame(a)

  nombres  peso  altura
0    pepe   435       8
1   maria    46       8

In [57]:
a['altura']

8

In [51]:
df.keys()

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

In [50]:
df['occupation']

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

In [49]:
df['shape']

KeyError: 'shape'

### [X] Step 12. How many different occupations are in this dataset?

In [61]:
df['occupation'].value_counts()

student          196
other            105
educator          95
administrator     79
engineer          67
programmer        66
librarian         51
writer            45
executive         32
scientist         31
artist            28
technician        27
marketing         26
entertainment     18
healthcare        16
retired           14
lawyer            12
salesman          12
none               9
homemaker          7
doctor             7
Name: occupation, dtype: int64

In [63]:
df['occupation'].unique()

array(['technician', 'other', 'writer', 'executive', 'administrator',
       'student', 'lawyer', 'educator', 'scientist', 'entertainment',
       'programmer', 'librarian', 'homemaker', 'artist', 'engineer',
       'marketing', 'none', 'healthcare', 'retired', 'salesman', 'doctor'],
      dtype=object)

In [64]:
df['occupation'].unique().shape

(21,)

In [65]:
len(df['occupation'].unique())

21

In [87]:
user_id['occupation'].value_counts().count()

#¿otras alternativas?

21

### Step 13. What is the most frequent occupation?

In [73]:
# Con el df.occupation.value_counts() de antes, podemos apreciar que student es el empleo más frecuente con 196 datos

In [66]:
df.occupation.value_counts()

student          196
other            105
educator          95
administrator     79
engineer          67
programmer        66
librarian         51
writer            45
executive         32
scientist         31
artist            28
technician        27
marketing         26
entertainment     18
healthcare        16
retired           14
lawyer            12
salesman          12
none               9
homemaker          7
doctor             7
Name: occupation, dtype: int64

In [67]:
df.occupation.value_counts().head(1)

student    196
Name: occupation, dtype: int64

In [67]:
df.occupation.value_counts().head(1)

student    196
Name: occupation, dtype: int64

In [68]:
type(df.occupation.value_counts().head(1))

pandas.core.series.Series

In [69]:
df.occupation

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

In [70]:
df.occupation.value_counts().head(1)

student    196
Name: occupation, dtype: int64

In [71]:
df.occupation.value_counts().head(1).values

array([196])

In [78]:
df.occupation.value_counts().head(1).index

Index(['student'], dtype='object')

In [79]:
df.occupation.value_counts().head(1).index[0]

'student'

In [81]:
df.occupation.value_counts().index[0]

'student'

In [82]:
df.occupation.value_counts().index

Index(['student', 'other', 'educator', 'administrator', 'engineer',
       'programmer', 'librarian', 'writer', 'executive', 'scientist', 'artist',
       'technician', 'marketing', 'entertainment', 'healthcare', 'retired',
       'lawyer', 'salesman', 'none', 'homemaker', 'doctor'],
      dtype='object')

In [85]:
df.occupation.value_counts().idxmax()

'student'

In [86]:
df.occupation.value_counts()

student          196
other            105
educator          95
administrator     79
engineer          67
programmer        66
librarian         51
writer            45
executive         32
scientist         31
artist            28
technician        27
marketing         26
entertainment     18
healthcare        16
retired           14
lawyer            12
salesman          12
none               9
homemaker          7
doctor             7
Name: occupation, dtype: int64

In [73]:
df.occupation.index

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name='user_id', length=943)

In [77]:
df.occupation

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

In [75]:
df.occupation.name

'occupation'

In [76]:
df.occupation.dtypes

dtype('O')

In [74]:
df.occupation.values

array(['technician', 'other', 'writer', 'technician', 'other',
       'executive', 'administrator', 'administrator', 'student', 'lawyer',
       'other', 'other', 'educator', 'scientist', 'educator',
       'entertainment', 'programmer', 'other', 'librarian', 'homemaker',
       'writer', 'writer', 'artist', 'artist', 'engineer', 'engineer',
       'librarian', 'writer', 'programmer', 'student', 'artist',
       'student', 'student', 'administrator', 'homemaker', 'student',
       'student', 'other', 'entertainment', 'scientist', 'engineer',
       'administrator', 'librarian', 'technician', 'programmer',
       'marketing', 'marketing', 'administrator', 'student', 'writer',
       'educator', 'student', 'programmer', 'executive', 'programmer',
       'librarian', 'none', 'programmer', 'educator', 'healthcare',
       'engineer', 'administrator', 'marketing', 'educator', 'educator',
       'student', 'student', 'student', 'engineer', 'engineer',
       'scientist', 'administrator', 'student', 'scientist',
       'entertainment', 'student', 'technician', 'administrator',
       'administrator', 'administrator', 'student', 'programmer', 'other',
       'executive', 'educator', 'administrator', 'administrator',
       'librarian', 'administrator', 'educator', 'marketing',
       'entertainment', 'executive', 'student', 'administrator', 'artist',
       'artist', 'executive', 'student', 'executive', 'student',
       'programmer', 'student', 'student', 'engineer', 'retired',
       'scientist', 'educator', 'other', 'student', 'engineer',
       'salesman', 'executive', 'programmer', 'engineer', 'healthcare',
       'student', 'administrator', 'programmer', 'other', 'librarian',
       'writer', 'artist', 'student', 'lawyer', 'lawyer', 'none',
       'marketing', 'marketing', 'none', 'administrator', 'other',
       'engineer', 'programmer', 'student', 'other', 'educator', 'doctor',
       'student', 'student', 'programmer', 'other', 'technician',
       'programmer', 'entertainment', 'artist', 'librarian', 'engineer',
       'marketing', 'artist', 'administrator', 'educator', 'student',
       'student', 'other', 'educator', 'engineer', 'educator', 'student',
       'programmer', 'lawyer', 'artist', 'administrator', 'healthcare',
       'other', 'educator', 'other', 'other', 'other', 'healthcare',
       'educator', 'marketing', 'other', 'administrator', 'scientist',
       'scientist', 'programmer', 'other', 'entertainment',
       'administrator', 'executive', 'programmer', 'scientist',
       'librarian', 'librarian', 'executive', 'educator', 'student',
       'artist', 'administrator', 'administrator', 'educator', 'student',
       'administrator', 'scientist', 'writer', 'technician', 'student',
       'writer', 'programmer', 'writer', 'educator', 'student',
       'librarian', 'lawyer', 'student', 'marketing', 'engineer',
       'educator', 'engineer', 'salesman', 'educator', 'executive',
       'librarian', 'programmer', 'engineer', 'other', 'administrator',
       'programmer', 'librarian', 'student', 'programmer', 'student',
       'educator', 'administrator', 'student', 'executive', 'student',
       'librarian', 'student', 'librarian', 'scientist', 'engineer',
       'retired', 'educator', 'writer', 'administrator', 'administrator',
       'artist', 'educator', 'student', 'educator', 'educator',
       'technician', 'student', 'student', 'engineer', 'student',
       'student', 'executive', 'doctor', 'engineer', 'librarian',
       'educator', 'entertainment', 'none', 'student', 'student',
       'student', 'artist', 'administrator', 'student', 'programmer',
       'writer', 'executive', 'administrator', 'engineer', 'engineer',
       'librarian', 'student', 'engineer', 'scientist', 'other',
       'student', 'engineer', 'student', 'administrator', 'librarian',
       'programmer', 'librarian', 'student', 'administrator',
       'programmer', 'executive', 'programmer', 'student', 'salesman',
       'marketing', 'none', 'engineer', 'student', 'programmer', 'writer',
       'technician', 'educator', 'administrator', 'educator', 'executive',
       'doctor', 'programmer', 'student', 'educator', 'student',
       'student', 'programmer', 'other', 'student', 'retired',
       'scientist', 'educator', 'technician', 'other', 'marketing',
       'student', 'educator', 'other', 'administrator', 'retired',
       'programmer', 'student', 'educator', 'student', 'student',
       'student', 'technician', 'administrator', 'student',
       'administrator', 'educator', 'educator', 'entertainment',
       'student', 'other', 'librarian', 'executive', 'salesman',
       'scientist', 'librarian', 'lawyer', 'engineer', 'student', 'other',
       'engineer', 'librarian', 'librarian', 'other', 'student',
       'student', 'retired', 'student', 'educator', 'programmer',
       'scientist', 'librarian', 'student', 'homemaker', 'executive',
       'educator', 'student', 'other', 'student', 'homemaker', 'student',
       'engineer', 'lawyer', 'student', 'student', 'student', 'student',
       'writer', 'engineer', 'student', 'other', 'executive',
       'entertainment', 'other', 'student', 'student', 'programmer',
       'engineer', 'artist', 'engineer', 'administrator', 'programmer',
       'writer', 'salesman', 'entertainment', 'other', 'writer', 'writer',
       'student', 'writer', 'student', 'administrator', 'other',
       'engineer', 'student', 'other', 'other', 'administrator',
       'healthcare', 'engineer', 'other', 'programmer', 'healthcare',
       'educator', 'engineer', 'student', 'administrator', 'artist',
       'educator', 'educator', 'educator', 'programmer', 'educator',
       'student', 'other', 'none', 'lawyer', 'educator', 'programmer',
       'entertainment', 'other', 'marketing', 'student', 'educator',
       'doctor', 'student', 'student', 'scientist', 'marketing',
       'entertainment', 'artist', 'student', 'engineer', 'administrator',
       'other', 'administrator', 'administrator', 'other', 'technician',
       'student', 'salesman', 'lawyer', 'writer', 'educator',
       'administrator', 'entertainment', 'librarian', 'educator',
       'student', 'administrator', 'student', 'other', 'administrator',
       'technician', 'salesman', 'technician', 'student', 'other',
       'student', 'student', 'healthcare', 'writer', 'other', 'student',
       'engineer', 'engineer', 'educator', 'programmer', 'student',
       'student', 'student', 'executive', 'programmer', 'student',
       'student', 'other', 'educator', 'retired', 'retired', 'student',
       'scientist', 'student', 'educator', 'educator', 'engineer',
       'technician', 'other', 'artist', 'writer', 'educator', 'engineer',
       'administrator', 'engineer', 'student', 'student', 'writer',
       'programmer', 'administrator', 'student', 'student', 'writer',
       'writer', 'other', 'programmer', 'writer', 'marketing',
       'administrator', 'other', 'student', 'other', 'administrator',
       'programmer', 'marketing', 'librarian', 'student', 'writer',
       'other', 'healthcare', 'student', 'engineer', 'administrator',
       'educator', 'administrator', 'marketing', 'librarian', 'student',
       'administrator', 'engineer', 'salesman', 'student', 'librarian',
       'student', 'educator', 'engineer', 'engineer', 'scientist',
       'administrator', 'engineer', 'student', 'student', 'scientist',
       'other', 'technician', 'executive', 'educator', 'writer',
       'scientist', 'student', 'programmer', 'other', 'educator',
       'scientist', 'educator', 'educator', 'writer', 'writer',
       'executive', 'student', 'engineer', 'administrator', 'librarian',
       'retired', 'student', 'student', 'entertainment', 'educator',
       'educator', 'educator', 'artist', 'educator', 'retired',
       'educator', 'marketing', 'executive', 'student', 'administrator',
       'educator', 'student', 'other', 'student', 'engineer', 'student',
       'librarian', 'student', 'other', 'student', 'lawyer', 'educator',
       'librarian', 'student', 'educator', 'educator', 'programmer',
       'artist', 'other', 'marketing', 'student', 'programmer', 'artist',
       'other', 'programmer', 'educator', 'engineer', 'programmer',
       'healthcare', 'other', 'student', 'student', 'librarian',
       'educator', 'marketing', 'educator', 'educator', 'scientist',
       'writer', 'student', 'student', 'writer', 'student', 'programmer',
       'educator', 'student', 'programmer', 'scientist', 'engineer',
       'none', 'other', 'healthcare', 'student', 'student', 'programmer',
       'engineer', 'other', 'educator', 'other', 'engineer', 'librarian',
       'student', 'student', 'student', 'scientist', 'retired',
       'programmer', 'student', 'educator', 'engineer', 'student',
       'engineer', 'retired', 'other', 'executive', 'student',
       'healthcare', 'educator', 'none', 'programmer', 'educator',
       'student', 'programmer', 'librarian', 'other', 'engineer',
       'administrator', 'administrator', 'librarian', 'writer', 'other',
       'technician', 'programmer', 'administrator', 'educator', 'student',
       'other', 'programmer', 'other', 'educator', 'student', 'lawyer',
       'marketing', 'programmer', 'librarian', 'student', 'librarian',
       'educator', 'healthcare', 'administrator', 'other', 'salesman',
       'educator', 'engineer', 'healthcare', 'programmer', 'writer',
       'other', 'other', 'programmer', 'other', 'student', 'librarian',
       'other', 'educator', 'librarian', 'student', 'student',
       'librarian', 'homemaker', 'other', 'student', 'student', 'student',
       'other', 'engineer', 'technician', 'administrator', 'technician',
       'technician', 'other', 'administrator', 'entertainment',
       'homemaker', 'executive', 'executive', 'student', 'administrator',
       'student', 'executive', 'student', 'scientist', 'educator',
       'other', 'other', 'other', 'healthcare', 'writer', 'programmer',
       'technician', 'technician', 'educator', 'writer', 'student',
       'programmer', 'marketing', 'writer', 'engineer', 'other',
       'administrator', 'other', 'administrator', 'other', 'retired',
       'salesman', 'librarian', 'educator', 'none', 'student', 'student',
       'student', 'other', 'student', 'administrator', 'scientist',
       'educator', 'student', 'other', 'engineer', 'administrator',
       'executive', 'student', 'student', 'writer', 'student', 'student',
       'executive', 'librarian', 'programmer', 'student', 'student',
       'programmer', 'student', 'artist', 'marketing', 'administrator',
       'engineer', 'engineer', 'student', 'administrator', 'other',
       'technician', 'educator', 'programmer', 'student', 'educator',
       'programmer', 'writer', 'other', 'writer', 'administrator',
       'programmer', 'writer', 'administrator', 'administrator',
       'educator', 'other', 'marketing', 'healthcare', 'salesman',
       'marketing', 'other', 'educator', 'technician', 'student', 'other',
       'other', 'other', 'student', 'librarian', 'administrator',
       'student', 'engineer', 'librarian', 'artist', 'other', 'engineer',
       'artist', 'engineer', 'librarian', 'writer', 'programmer', 'other',
       'technician', 'writer', 'other', 'executive', 'artist', 'artist',
       'student', 'entertainment', 'artist', 'doctor', 'writer',
       'librarian', 'engineer', 'doctor', 'lawyer', 'student', 'engineer',
       'student', 'technician', 'other', 'administrator', 'writer',
       'student', 'librarian', 'marketing', 'administrator', 'educator',
       'other', 'retired', 'student', 'executive', 'student',
       'programmer', 'artist', 'other', 'scientist', 'programmer',
       'student', 'student', 'executive', 'student', 'administrator',
       'scientist', 'student', 'other', 'other', 'educator',
       'administrator', 'student', 'marketing', 'engineer', 'librarian',
       'engineer', 'other', 'student', 'student', 'scientist',
       'technician', 'student', 'administrator', 'other', 'student',
       'educator', 'librarian', 'writer', 'other', 'homemaker', 'other',
       'retired', 'executive', 'artist', 'educator', 'student', 'other',
       'librarian', 'other', 'librarian', 'educator', 'healthcare',
       'writer', 'other', 'student', 'other', 'entertainment', 'engineer',
       'student', 'scientist', 'other', 'artist', 'student',
       'administrator', 'student', 'other', 'salesman', 'entertainment',
       'programmer', 'student', 'scientist', 'scientist', 'educator',
       'educator', 'student', 'engineer', 'doctor', 'other', 'educator',
       'technician', 'student', 'administrator', 'student', 'librarian',
       'student'], dtype=object)

In [88]:
df.user_id

AttributeError: 'DataFrame' object has no attribute 'user_id'

In [89]:
df.index

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name='user_id', length=943)

In [91]:
df.columns

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

In [93]:
df[['occupation']]

            occupation
user_id
1           technician
2                other
3               writer
4           technician
5                other
...                ...
939            student
940      administrator
941            student
942          librarian
943            student

[943 rows x 1 columns]

In [95]:
df.groupby('gender').age.mean()

gender
F    33.813187
M    34.149254
Name: age, dtype: float64

In [96]:
df.groupby('gender').age.mean().to_frame()

              age
gender
F       33.813187
M       34.149254

In [97]:
pd.DataFrame(df.groupby('gender').age.mean())

              age
gender
F       33.813187
M       34.149254

In [ ]:
pd.tofr

In [92]:
df.occupation

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

### [X] Step 14. Summarize the DataFrame.

In [98]:
df.describe()
# user_id.info() ? No sé qué cojones quiere decirme con resumir el df.

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

### [ ]Step 15. Summarize all the columns

In [101]:
df.dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

In [104]:
df.replace({'M': True, 'F': False})

         age  gender     occupation zip_code
user_id
1         24    True     technician    85711
2         53   False          other    94043
3         23    True         writer    32067
4         24    True     technician    43537
5         33   False          other    15213
...      ...     ...            ...      ...
939       26   False        student    33319
940       32    True  administrator    02215
941       20    True        student    97229
942       48   False      librarian    78209
943       22    True        student    77841

[943 rows x 4 columns]

In [103]:
df.replace({'M': True, 'F': False}).dtypes

age            int64
gender          bool
occupation    object
zip_code      object
dtype: object

In [99]:
df

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
...      ...    ...            ...      ...
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[943 rows x 4 columns]

In [ ]:
pd.read_excel()

In [106]:
df.describe(percentiles='all')

TypeError: '<=' not supported between instances of 'int' and 'numpy.str_'

In [108]:
df.describe('all')

TypeError: '<=' not supported between instances of 'int' and 'numpy.str_'

In [109]:
df.describe(include = 'all')

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN

In [100]:
df.describe()

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

In [89]:
user_id.columns.describe()
# no fckn idea

AttributeError: 'Index' object has no attribute 'describe'

### Step 16. Summarize only the occupation column

In [78]:
user_id.occupation.describe()

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

### Step 17. What is the mean age of users?

In [83]:
ages = user_id.age.mean()
round(ages)

34

### Step 18. What is the age with least occurrence?

In [110]:
df.age.value_counts().tail()

7     1
66    1
11    1
10    1
73    1
Name: age, dtype: int64

In [111]:
df.age.value_counts()

30    39
25    38
22    37
28    36
27    35
      ..
7      1
66     1
11     1
10     1
73     1
Name: age, Length: 61, dtype: int64

In [116]:
res = df.age.value_counts()

In [117]:
res

30    39
25    38
22    37
28    36
27    35
      ..
7      1
66     1
11     1
10     1
73     1
Name: age, Length: 61, dtype: int64

In [118]:
mask = res == 1

In [119]:
mask

30    False
25    False
22    False
28    False
27    False
      ...
7      True
66     True
11     True
10     True
73     True
Name: age, Length: 61, dtype: bool

In [121]:
res[mask]

7     1
66    1
11    1
10    1
73    1
Name: age, dtype: int64